void main() {
  var x = 5;
  var y = x++; // حيساوي القيمه الاول و بعد كدا يضيف علي ال X
  // x = 6 , y = 5
  print('x = $x , y = $y');
  print('++x = ${++x}'); // كدا معناها حيضيف علي قيمه ال x و بعد كدا يطبع
  // x = 7
  var z = --x; // كدا معناها حينقص من قيمه ال x و بعد كدا يحطها في ال z
  print('z = $z'); // z = 6 , x = 6
  print('x-- = ${x--}');// كدا حيطبع ال x الاول و بعد كدا حينقص من قيمه ال x
  print('x = $x');      // x = 5
  print('--x = ${--x}');//كدا حينقص قيمه ال x و بعد كدا يبطع
                        // x = 4
}
